app/Models/UsernameModel.php

    public function obtenerUsuario($data){
        $username = $this->db->table('login');
        $username->where($data);
        return $username->get()->getResultArray();
---
SELECT *
FROM `login`
WHERE `username` = 'admin@gmail.com'
 LIMIT 1